erp3l/src/Catalogs/ТабличныеЧастиБД/ТабличныеЧастиБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТабличныеЧастиБД</name>
  <owners>Catalog.СправочникиБД</owners>
  <owners>Catalog.ДокументыБД</owners>
  <owners>Catalog.ПланыВидовХарактеристикБД</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ТабличныеЧастиБД/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.СправочникиБД") Тогда
		Элементы.Владелец.Заголовок="Справочник";
	ИначеЕсли ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.ДокументыБД") Тогда
		Элементы.Владелец.Заголовок="Документ";
	КонецЕсли;
	
	Владелец=Объект.Владелец.Синоним;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя="РеквизитыТипДанных" Тогда
		
		ДанныеОбъекта=Новый Структура;
		ДанныеОбъекта.Вставить("ИмяОбъекта",СтрШаблон(Нстр("ru = '%1 %2, табличная часть %3'"), НРег(Элементы.Владелец.Заголовок), Владелец, 
			Объект.Синоним));
		ДанныеОбъекта.Вставить("ТекстПоля",СтрШаблон(Нстр("ru = ' реквизит %1'"), Элементы.Реквизиты.ТекущиеДанные.Имя));
		ДанныеОбъекта.Вставить("ТипДанных",Элементы.Реквизиты.ТекущиеДанные.ТипДанных);	
		
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТипаЗначений",ДанныеОбъекта);		
		
	КонецЕсли;
	
КонецПроцедуры
